package ru.stimmax.lessons.lesson15

//Задание 1. Иерархии в окружающем мире. Зная базовый "класс" назови его производные
// и производные для производных классов.

//Иерархия живых существ:
//Живое существо
//Растения, Животные, Грибы
//Растения -
//Животные -> млекопитающие - летающие - насекомые


//Иерархия электронных устройств:
//Электронное устройство (метод - вкл и выкл)
//Стационарное, Мобильное
// Мобильные (свойство для всех - емкость аккумулятора) (телефоны, планшеты, ноутбуки)


//Иерархия одежды
//Одежда (свойство - размер, материал)
//Верхняя одежда, Нижнее бельё, Обувь
//


//Задание 2. На примере этого абстрактного класса нужно создать три варианта
// работы с содержимым поля materials, при этом абстрактный класс изменять нельзя.

//Создайте класс, с методом, который будет вынимать объект с индексом 0,
// остальное оставлять в контейнере (без этого объекта)

//То-же самое, только с последним индексом

//То-же самое, только с индексом посерединке



//Вариант решения

